# RoutingPreferenceManager Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoutingPreferenceManager Members
RoutingPreferenceManager Class Methods Properties See Also
---
The RoutingPreferenceManager type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule) | Adds a new routing preference rule to the rule group. |
| AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule, Int32) | Adds a new routing preference rule to the specified position in the rule group. |
| Dispose | Releases all resources used by the RoutingPreferenceManager |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetMEPPartId | Gets a fitting or segment id of given routing preference group that meets the specified routing conditions. |
| GetNumberOfRules | The number of RoutingPreference rules in a group. |
| GetRule | Gets the specified rule. |
| GetSharedSizes | Gets a list of all segments of a given profile shape that define a given size. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| RemoveRule | Removes an existing routing preference rule. Thrown if the index is out of bounds. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OwnerId | The Id of the MEPCurveType that owns the RoutingPreferenceManager |
| PreferredJunctionType | The preferred junction type. |

# See Also
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace